app/Controllers/AbsenController.php

UPDATE `tbl_absen` SET `out` = '2023-07-19  15:38:18'
WHERE `tbl_absen`.`id_absen` IN ('381')
---
    public function absen_pegawai($nomor_induk){
        $data['session'] = $this->session;

        $nomor_induk = $nomor_induk;

        date_default_timezone_set('Asia/Jakarta');
        $waktu_sekarang = date('Y-m-d  H:i:s');

        // CEK DATA PEGAWAI
        $data_pegawai = $this->model_pegawai->getPegawaiByNomorInduk($nomor_induk);

        if($data_pegawai){
            // CEK DATA ABSEN
            $data_absen = $this->model_absen->getAbsenByIdNomorIndukByWaktuIn($nomor_induk);

            if ($data_absen) {
                $data_absen_pegawai = [
                    'out' => $waktu_sekarang,
                ];

                $this->model_absen->update($data_absen[0]->id_absen, $data_absen_pegawai);

UPDATE `tbl_absen` SET `konfirmasi_petugas` = '0'
WHERE `tbl_absen`.`id_absen` IN ('503')
---
    public function update_konfirmasi_petugas($id_absen, $konfirmasi_petugas){
        $data_absen_pegawai = [
            'konfirmasi_petugas' => $konfirmasi_petugas,
        ];

        $this->model_absen->update($id_absen, $data_absen_pegawai);