app/Controllers/PegawaiController.php

SELECT *
FROM `tbl_pegawai`
SELECT *
FROM `tbl_jabatan`
SELECT *
FROM `tbl_divisi`
---
    public function edit($id_pegawai){
        $data['title'] = 'Data Pegawai - Edit';
        $data['session'] = $this->session;
        $data['getPegawaiMaster'] = $this->model_pegawai->getPegawai($id_pegawai);
        $data['getPegawai'] = $this->model_pegawai->findAll();
        $data['getJabatan'] = $this->model_jabatan->findAll();
        $data['getDivisi'] = $this->model_divisi->findAll();

UPDATE `tbl_pegawai` SET `id_jabatan` = '1', `id_divisi` = '1', `nama_pegawai` = 'Santy Dewi', `pendidikan` = 'Tidak Sekolah', `lead` = '', `gender` = '0', `tgl_lahir` = '2023-07-03', `tgl_masuk` = '2023-05-07'
WHERE `tbl_pegawai`.`id_pegawai` IN ('25')
---
    public function update(){
        $data['session'] = $this->session;
        $rules = [
            'nama_pegawai' => 'required'
        ];

        if($this->validate($rules)){
            $id_pegawai = $this->request->getVar('id_pegawai');

            $data_pegawai = [
                'id_jabatan' => $this->request->getVar('id_jabatan'),
                'id_divisi' => $this->request->getVar('id_divisi'),
                'nama_pegawai' => $this->request->getVar('nama_pegawai'),
                'pendidikan' => $this->request->getVar('pendidikan'),
                'lead' => $this->request->getVar('lead'),
                'gender' => $this->request->getVar('gender'),
                'tgl_lahir' => $this->request->getVar('tgl_lahir'),
                'tgl_masuk' => $this->request->getVar('tgl_masuk')
            ];

            $this->model_pegawai->update($id_pegawai, $data_pegawai);