app/Controllers/PegawaiController.php

    public function delete($id){
        $model = new UserModel;
        $model->delete($id);
---
DELETE FROM `tbl_user`
WHERE `id` IN ('31')